{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,88],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"advantage","class_name":null,"config":{"name":"advantage","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]},{"name":"state_value","class_name":null,"config":{"name":"state_value","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]},{"name":"advantage_normalization","class_name":null,"config":{"name":"advantage_normalization","trainable":true},"inbound_nodes":[[["advantage",0,0,{}],["state_value",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["advantage_normalization",0,0],["advantage_normalization",0,1]]},"keras_version":"tfjs-layers 4.4.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[88,64],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[64],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[64],"dtype":"float32"},{"name":"advantage/kernel","shape":[64,3],"dtype":"float32"},{"name":"advantage/bias","shape":[3],"dtype":"float32"},{"name":"state_value/kernel","shape":[64,1],"dtype":"float32"},{"name":"state_value/bias","shape":[1],"dtype":"float32"},{"name":"advantage/kernelStddev","shape":[64,3],"dtype":"float32"},{"name":"advantage/biasStddev","shape":[3],"dtype":"float32"},{"name":"state_value/kernelStddev","shape":[64,1],"dtype":"float32"},{"name":"state_value/biasStddev","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.4.0","convertedBy":null}